# MEPSpaceConstruction Class

---
Construction definition for Space.
SystemObject Autodesk.Revit.DB.MechanicalMEPSpaceConstruction
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class MEPSpaceConstruction

    Public Class MEPSpaceConstruction

    public ref class MEPSpaceConstruction

    type MEPSpaceConstruction = class end
The MEPSpaceConstruction type exposes the following members.
| Name| Description
---|---|---
| CurrentConstruction| Get all the Building Constructions according to the specific Construction type.
| SpaceConstructions| Return all the Space constructions of current space.
Top
| Name| Description
---|---|---
| DeleteConstruction| Remove an existing construction from Space constructions.
| DuplicateConstruction| Create a new construction for Space constructions.
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| NewConstruction| Create a new construction for Space constructions.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
This is used to define the information in Constructions.xml.
#### Reference
Autodesk.Revit.DB.Mechanical Namespace